<pre>

<?php

define('NAME_CONST', 10);
var_dump(NAME_CONST);


var_dump(__FILE__); // указывает путь текущего файла
var_dump(__LINE__); // выводит текущию строку, которая была выполнена
var_dump(__DIR__); // путь к корневой папке исполняемого файла
var_dump(__FUNCTION__); // выводит текущию функцию, которая была выполнена
var_dump(__CLASS__); // выводит название исполняемого класса
var_dump(__METHOD__);// выводит название исполняемого метода в классе
var_dump(__NAMESPACE__); // выводмт название пространства имён




?>

</pre>